---
kind: method
id: M:Autodesk.Revit.UI.Selection.Selection.GetElementIds
source: html/4af3bdc7-e69c-8aa6-406d-865d7f036927.htm
---
# Autodesk.Revit.UI.Selection.Selection.GetElementIds Method

Returns the ids of the elements that are currently selected within the project.
 The selection may not be complete. See GetReferences for more options.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetElementIds()
```

## Returns
The collection containing the ids of the selected elements.